## plan
```diff
+ Green
- Red
! Orange
@@ Pink @@
#Gray
module.complete.random_id.this: Refreshing state... [id=Jg]
module.key-pair.tls_private_key.this[0]: Refreshing state... [id=4552ec6daed8c1fbcb0944de1897f7fec03982dd]
module.complete.data.http.my_public_ip: Reading...
module.complete.data.http.my_public_ip: Read complete after 0s [id=https://ifconfig.co/json]
module.complete.data.aws_ami_ids.sfos: Reading...
module.complete.data.aws_region.current: Reading...
data.aws_region.current: Reading...
data.aws_availability_zones.available: Reading...
module.complete.data.aws_iam_policy_document.trust_relationship: Reading...
module.complete.aws_secretsmanager_secret.console_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-OQsHDY]
module.complete.aws_secretsmanager_secret.config_backup_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-vUT4N0]
module.complete.data.aws_availability_zones.available: Reading...
module.complete.aws_secretsmanager_secret.secure_storage_master_key: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-VM53TW]
module.key-pair.aws_key_pair.this[0]: Refreshing state... [id=sophos]
data.aws_region.current: Read complete after 0s [id=us-west-1]
module.complete.data.aws_region.current: Read complete after 0s [id=us-west-1]
module.complete.data.aws_iam_policy_document.trust_relationship: Read complete after 0s [id=1903849331]
module.complete.data.aws_caller_identity.current: Reading...
data.aws_availability_zones.available: Read complete after 0s [id=us-west-1]
data.aws_availability_zone.available["us-west-1c"]: Reading...
data.aws_availability_zone.available["us-west-1b"]: Reading...
module.complete.data.aws_availability_zones.available: Read complete after 0s [id=us-west-1]
data.aws_availability_zone.available["us-west-1c"]: Read complete after 0s [id=us-west-1c]
module.complete.aws_secretsmanager_secret_version.console_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-OQsHDY|17CDCF85-0F79-47EA-ACD7-5035BFC2AECC]
module.complete.aws_secretsmanager_secret_version.secure_storage_master_key: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-VM53TW|3089D4D7-6884-47D0-A662-681183441074]
module.complete.data.aws_iam_policy_document.secure_storage_master_key: Reading...
module.complete.data.aws_iam_policy_document.secure_storage_master_key: Read complete after 0s [id=22107448]
module.complete.data.template_file.user_data: Reading...
module.complete.data.aws_iam_policy_document.ec2_iam_policy: Reading...
module.complete.data.template_file.user_data: Read complete after 0s [id=9f0ac8368a425d7c0736e38cae26df83b64425277a588813245e5113292bd4d6]
module.complete.aws_secretsmanager_secret_version.config_backup_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-vUT4N0|4A68A4B0-18EA-4ECB-B853-20DB550DEFA5]
module.complete.data.aws_iam_policy_document.ec2_iam_policy: Read complete after 0s [id=2639135297]
data.aws_availability_zone.available["us-west-1b"]: Read complete after 0s [id=us-west-1b]
module.complete.data.aws_ami_ids.sfos: Read complete after 0s [id=1726762986]
module.complete.data.aws_ami.dynamic_ami["ami-03cbb6f8e3173ca7a"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0f37b9b5182756d01"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0b68236d144f48351"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-04b0be28f678af9ee"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-030bf19f87a227c8a"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-065fabeba927f04d3"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0eafce265f8e28d06"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-07186848dc5aa7580"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0442ca42ae7162b75"]: Reading...
module.complete.data.aws_caller_identity.current: Read complete after 0s [id=447552758530]
module.complete.data.aws_ami.dynamic_ami["ami-0fb2a8cf2684fdb0c"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-04b0be28f678af9ee"]: Read complete after 0s [id=ami-04b0be28f678af9ee]
module.complete.data.aws_ami.dynamic_ami["ami-0b68236d144f48351"]: Read complete after 0s [id=ami-0b68236d144f48351]
module.complete.data.aws_ami.dynamic_ami["ami-03cbb6f8e3173ca7a"]: Read complete after 0s [id=ami-03cbb6f8e3173ca7a]
module.complete.data.aws_ami.dynamic_ami["ami-0028214389e81fc39"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-053dbe57dfe422765"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-030bf19f87a227c8a"]: Read complete after 0s [id=ami-030bf19f87a227c8a]
module.complete.data.aws_ami.dynamic_ami["ami-0f37b9b5182756d01"]: Read complete after 0s [id=ami-0f37b9b5182756d01]
module.complete.data.aws_ami.dynamic_ami["ami-091558582143f9648"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-059bf44c0f5e904d9"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-026c32ba32c93b8c4"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0442ca42ae7162b75"]: Read complete after 0s [id=ami-0442ca42ae7162b75]
module.complete.data.aws_ami.dynamic_ami["ami-0434af33056d1e189"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0eafce265f8e28d06"]: Read complete after 0s [id=ami-0eafce265f8e28d06]
module.complete.data.aws_ami.dynamic_ami["ami-07186848dc5aa7580"]: Read complete after 0s [id=ami-07186848dc5aa7580]
module.complete.aws_vpc.this[0]: Refreshing state... [id=vpc-0568be9eba6b61345]
module.complete.data.aws_ami.dynamic_ami["ami-065fabeba927f04d3"]: Read complete after 0s [id=ami-065fabeba927f04d3]
module.complete.aws_iam_role.this: Refreshing state... [id=ec2-iam-role-SOPHOS_CNF-26-447552758530]
module.complete.data.aws_ami.dynamic_ami["ami-053dbe57dfe422765"]: Read complete after 1s [id=ami-053dbe57dfe422765]
module.complete.data.aws_ami.dynamic_ami["ami-091558582143f9648"]: Read complete after 1s [id=ami-091558582143f9648]
module.complete.data.aws_ami.dynamic_ami["ami-0028214389e81fc39"]: Read complete after 1s [id=ami-0028214389e81fc39]
module.complete.data.aws_ami.dynamic_ami["ami-059bf44c0f5e904d9"]: Read complete after 1s [id=ami-059bf44c0f5e904d9]
module.complete.data.aws_ami.dynamic_ami["ami-0fb2a8cf2684fdb0c"]: Read complete after 1s [id=ami-0fb2a8cf2684fdb0c]
module.complete.data.aws_ami.dynamic_ami["ami-0434af33056d1e189"]: Read complete after 1s [id=ami-0434af33056d1e189]
module.complete.data.aws_ami.dynamic_ami["ami-026c32ba32c93b8c4"]: Read complete after 1s [id=ami-026c32ba32c93b8c4]
module.complete.aws_subnet.private[0]: Refreshing state... [id=subnet-06ddd2685a606b84a]
module.complete.aws_security_group.lan[0]: Refreshing state... [id=sg-0ce15d0dacc1d12d8]
module.complete.aws_internet_gateway.this[0]: Refreshing state... [id=igw-093f8b106da9e00cc]
module.complete.aws_route_table.public[0]: Refreshing state... [id=rtb-0c2973ca843f405a7]
module.complete.aws_subnet.public[0]: Refreshing state... [id=subnet-0323e823a4d261cab]
module.complete.aws_route_table.private[0]: Refreshing state... [id=rtb-0a2f7ca275e46c0c3]
module.complete.aws_security_group.public[0]: Refreshing state... [id=sg-08db6e0464197b1e7]
module.complete.aws_security_group.trusted[0]: Refreshing state... [id=sg-00ce6506851b8e199]
module.complete.aws_route.public: Refreshing state... [id=r-rtb-0c2973ca843f405a71080289494]
module.complete.aws_network_interface.private: Refreshing state... [id=eni-0089aa9b3f849cb71]
module.complete.aws_route_table_association.public: Refreshing state... [id=rtbassoc-03cff4a9e9c567aa7]
module.complete.aws_network_interface.public: Refreshing state... [id=eni-088b3264265feadc7]
module.complete.aws_route_table_association.private: Refreshing state... [id=rtbassoc-0820d3455f1a9c922]
module.complete.aws_route.private: Refreshing state... [id=r-rtb-0a2f7ca275e46c0c31080289494]
module.complete.aws_iam_instance_profile.this: Refreshing state... [id=ec2-instance-profile-SOPHOS_CNF-26]
module.complete.aws_launch_template.this: Refreshing state... [id=lt-06b49c0445878ea40]
module.complete.aws_instance.this: Refreshing state... [id=i-097c7e5281c4be054]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place

Terraform will perform the following actions:

  # module.complete.aws_eip.this[0] will be created
+   resource "aws_eip" "this" {
+       allocation_id             = (known after apply)
+       associate_with_private_ip = "10.0.0.172"
+       association_id            = (known after apply)
+       carrier_ip                = (known after apply)
+       customer_owned_ip         = (known after apply)
+       domain                    = (known after apply)
+       id                        = (known after apply)
+       instance                  = (known after apply)
+       network_border_group      = (known after apply)
+       network_interface         = "eni-088b3264265feadc7"
+       private_dns               = (known after apply)
+       private_ip                = (known after apply)
+       public_dns                = (known after apply)
+       public_ip                 = (known after apply)
+       public_ipv4_pool          = (known after apply)
+       tags_all                  = (known after apply)
+       vpc                       = true
    }

  # module.complete.aws_instance.this will be updated in-place
  ~ resource "aws_instance" "this" {
        id                                   = "i-097c7e5281c4be054"
      ~ source_dest_check                    = false -> true
        tags                                 = {
            "Name" = "sophos-xg-terraform"
        }
      ~ user_data                            = "d2592419247d1e8df61adbea17ba811ab2ed1b49" -> "a07570ff9cfc85e3e58ac71b3bf79d033821ad61"
        # (29 unchanged attributes hidden)

        # (9 unchanged blocks hidden)
    }

  # module.complete.aws_network_interface.private will be updated in-place
  ~ resource "aws_network_interface" "private" {
      ~ description               = "ENI for private subnet" -> "ENI for Private Subnet"
        id                        = "eni-0089aa9b3f849cb71"
        tags                      = {
            "Name" = "priv-eni-SOPHOS_CNF-26-447552758530"
        }
        # (22 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.complete.aws_security_group.trusted[0] will be updated in-place
  ~ resource "aws_security_group" "trusted" {
        id                     = "sg-00ce6506851b8e199"
      ~ ingress                = [
+           {
+               cidr_blocks      = [
+                   "4.1.23.100/32",
+                   "20.237.247.240/32",
                ]
+               description      = "Allow all from trusted IP"
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 65535
            },
-           {
-               cidr_blocks      = [
-                   "4.1.23.100/32",
-                   "40.121.252.177/32",
                ]
-               description      = "Allow all from trusted IP"
-               from_port        = 0
-               ipv6_cidr_blocks = []
-               prefix_list_ids  = []
-               protocol         = "tcp"
-               security_groups  = []
-               self             = false
-               to_port          = 65535
            },
        ]
        name                   = "Trusted Network"
        tags                   = {
            "Name" = "Trusted Network"
        }
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"     
```